##  Introduction

This notebook explores user, transaction, and product data from Fetch Rewards. The goal is to identify data quality issues, analyze trends, and answer business questions using SQL queries and visualizations.

In [13]:
import pandas as pd
import sqlite3

# Connect to SQLite DB 
conn = sqlite3.connect('takehome.db')

### Closed-ended questions:

1. Question : What are the top 5 brands by receipts scanned among users 21 and over?<br>
   Answer: `NERDS CANDY`, `DOVE`, `SOUR PATCH KIDS`,`HERSHEY'S`, `COCA-COLA`

In [97]:
query = """
SELECT p.BRAND, COUNT(DISTINCT t.RECEIPT_ID) AS receipts_scanned
FROM user u
JOIN "transaction" t ON u.ID = t.USER_ID
JOIN product p ON t.BARCODE = p.BARCODE
WHERE CAST((JULIANDAY('now') - JULIANDAY(u.BIRTH_DATE)) / 365.25 AS INTEGER) >= 21
GROUP BY p.BRAND
ORDER BY receipts_scanned DESC
LIMIT 6;
"""

pd.read_sql_query(query, conn)

             BRAND  receipts_scanned
0      NERDS CANDY                14
1             DOVE                14
2             None                14
3  SOUR PATCH KIDS                13
4        HERSHEY'S                13
5        COCA-COLA                13

2. Question : What are the top 5 brands by sales among users that have had their account for at least six months?<br>
   Anaswer : `ANNIE'S`, `HOMEGROWN`,`GROCERY`, `DOVE` ,`BAREFOOT`, `ORIBE`,`SHEA MOISTURE`

In [100]:
query = """
SELECT 
    p.BRAND, 
    SUM(t.FINAL_SALE) AS total_sales
FROM user u
JOIN "transaction" t ON u.ID = t.USER_ID
JOIN product p ON t.BARCODE = p.BARCODE
WHERE (JULIANDAY('now') - JULIANDAY(u.CREATED_DATE)) >= 182.625  -- approx 6 months
GROUP BY p.BRAND
ORDER BY total_sales DESC
LIMIT 6;
"""
pd.read_sql_query(query, conn)

                       BRAND  total_sales
0                       None     23904.02
1  ANNIE'S HOMEGROWN GROCERY      2321.04
2                       DOVE      2267.21
3                   BAREFOOT      2224.33
4                      ORIBE      2030.91
5              SHEA MOISTURE      1934.20

3. Question : What is the percentage of sales in the Health & Wellness category by generation? <br>
   Answer : Showing below

In [40]:
query = """
WITH user_gen AS (
    SELECT 
        ID AS USER_ID,
        CASE 
            WHEN CAST((JULIANDAY('now') - JULIANDAY(BIRTH_DATE)) / 365.25 AS INTEGER) BETWEEN 10 AND 25 THEN 'Gen Z'
            WHEN CAST((JULIANDAY('now') - JULIANDAY(BIRTH_DATE)) / 365.25 AS INTEGER) BETWEEN 26 AND 41 THEN 'Millennials'
            WHEN CAST((JULIANDAY('now') - JULIANDAY(BIRTH_DATE)) / 365.25 AS INTEGER) BETWEEN 42 AND 57 THEN 'Gen X'
            WHEN CAST((JULIANDAY('now') - JULIANDAY(BIRTH_DATE)) / 365.25 AS INTEGER) BETWEEN 58 AND 76 THEN 'Boomers'
            ELSE 'Other'
        END AS Generation
    FROM user
),
sales_by_gen AS (
    SELECT 
        g.Generation,
        SUM(t.FINAL_SALE) AS health_sales
    FROM user_gen g
    JOIN "transaction" t ON g.USER_ID = t.USER_ID
    JOIN product p ON t.BARCODE = p.BARCODE
    WHERE p.CATEGORY_1 = 'Health & Wellness'
    GROUP BY g.Generation
),
total_sales_by_gen AS (
    SELECT 
        g.Generation,
        SUM(t.FINAL_SALE) AS total_sales
    FROM user_gen g
    JOIN "transaction" t ON g.USER_ID = t.USER_ID
    GROUP BY g.Generation
)
SELECT 
    t.Generation,
    ROUND(CAST(s.health_sales AS FLOAT) / t.total_sales * 100, 2) AS health_sales_percentage
FROM total_sales_by_gen t
LEFT JOIN sales_by_gen s ON t.Generation = s.Generation
ORDER BY health_sales_percentage DESC;
"""
pd.read_sql_query(query, conn)

    Generation  health_sales_percentage
0  Millennials                 39215.44
1        Gen X                 21219.41
2      Boomers                 18104.80
3        Other                      NaN

### Open-ended questions:

1. Question: Who are Fetch’s power users? <br>
   Answer: Five user ID's `62ffec490d9dbaff18c0a999` , `62c09104baa38d1a1f6c260e` , `61a58ac49c135b462ccddd1c`, `610a8541ca1fab5b417b5d33`, `5c366bf06d9819129dfa1118`

Assumption : Power users are defined as users who have scanned at least 3 receipts and have total sales of $15 or more.

In [67]:
query = """
SELECT 
    u.ID AS user_id,
    COUNT(DISTINCT t.RECEIPT_ID) AS receipts_scanned,
    SUM(t.FINAL_SALE) AS total_sales
FROM user u
JOIN "transaction" t ON u.ID = t.USER_ID
GROUP BY u.ID
HAVING COUNT(DISTINCT t.RECEIPT_ID) >= 3 AND SUM(t.FINAL_SALE) >= 15
ORDER BY total_sales DESC;
"""
pd.read_sql_query(query, conn)

                    user_id  receipts_scanned  total_sales
0  62ffec490d9dbaff18c0a999                 3        52.28
1  62c09104baa38d1a1f6c260e                 3        20.28
2  61a58ac49c135b462ccddd1c                 3        19.92
3  610a8541ca1fab5b417b5d33                 3        17.65
4  5c366bf06d9819129dfa1118                 3        17.42

2. Question: Which is the leading brand in the Dips & Salsa category?
   Answer : TOSTITOS

Assumption : “Leading” is defined by total sales in the CATEGORY_2 = 'Dips & Salsa', Brand name null ignored for this anlysis

In [93]:
query = """
SELECT 
    p.BRAND,
    CATEGORY_2,
    SUM(t.FINAL_SALE) AS total_sales
FROM "transaction" t
JOIN product p ON t.BARCODE = p.BARCODE
WHERE p.CATEGORY_2 = 'Dips & Salsa'
GROUP BY p.BRAND
ORDER BY total_sales DESC
LIMIT 2;

"""
pd.read_sql_query(query, conn)

      BRAND    CATEGORY_2  total_sales
0      None  Dips & Salsa    226409.63
1  TOSTITOS  Dips & Salsa    103104.29

3. Question : At what percent has Fetch grown year over year? <br>
   Anaswer : -8% growth rate from July 2024 to August 2024

Assumption : “Growth” is measured as the change in total receipts scanned per month. We'll compare 2024-07 vs. 2024-08 based on SCAN_DATE as those are the two full month data we have.

In [141]:
query = """
WITH monthly_data AS (
    SELECT 
        STRFTIME('%Y-%m', SCAN_DATE) AS month,
        COUNT(DISTINCT RECEIPT_ID) AS receipts
    FROM "transaction"
    WHERE STRFTIME('%Y-%m', SCAN_DATE) IN ('2024-07', '2024-08')
    GROUP BY month
),
pivoted AS (
    SELECT
        MAX(CASE WHEN month = '2024-07' THEN receipts END) AS july_receipts,
        MAX(CASE WHEN month = '2024-08' THEN receipts END) AS august_receipts
    FROM monthly_data
)
SELECT 
    july_receipts,
    august_receipts,
    ROUND(
        CAST(august_receipts - july_receipts AS FLOAT) / july_receipts * 100, 
        2
    ) AS percent_growth
FROM pivoted;
"""
pd.read_sql_query(query, conn)

   july_receipts  august_receipts  percent_growth
0           9197             8457           -8.05